In [3]:
import numpy as np
import pandas as pd

In [2]:
grades={'omer':100,'cihan':90,'ali':50}
department={'omer':'CE','cihan':'EEE','ali':'IEE'}

In [8]:
pd.Series(grades)

omer     100
cihan     90
ali       50
dtype: int64

BÖYLE YAPMAK YERİNE LİSTE OLUSTURUP ARGÜMAN VEREBİLİRİZ

In [9]:
grades=[100,50,30]
department=['CE','EEE','IEE']
salary=[10000,8000,5000]
names=['omer','cihan','ali']

In [14]:
pd.Series(data=department,index=names)

omer      CE
cihan    EEE
ali      IEE
dtype: object

In [15]:
#İNDEXLER AYNI İSE ARİTMETİK İŞLEMLER YAPILABİLİR

In [16]:
#FARKLI İSE BULDUKLARINI İŞLEME SOKAR DİĞERLERİNİ NaN OLARAK DÖNDÜRÜR

In [19]:
different_1=pd.Series(data=np.array([10,20,30,40,50]),index=['a','b','c','d','e'])
different_2=pd.Series(data=np.array([1,1,1,1,1]),index=['a','t','c','g','d'])

In [20]:
different_1+different_2

a    11.0
b     NaN
c    31.0
d    41.0
e     NaN
g     NaN
t     NaN
dtype: float64

In [21]:
#SERİES TEK BOYUTLU BASİT DATALARI TUTAR ÇOK BOYUTLU DATALARDA DATAFRAME İŞİN İÇİNE GİRER

DATAFRAME

In [22]:
data=np.random.randn(4,3)

In [26]:
df=pd.DataFrame(data,columns=['YAŞ','MAAŞ','TELEFON'],index=['omer','cihan','ali','asaf'])

In [27]:
df

            YAŞ      MAAŞ   TELEFON
omer   1.241410  0.254129 -0.262377
cihan  0.759339  1.079162 -0.005055
ali   -0.461731 -0.561912 -1.624737
asaf  -0.807754 -2.100753 -0.615496

In [33]:
df.loc['omer'] #satır almak için loc

YAŞ        1.241410
MAAŞ       0.254129
TELEFON   -0.262377
Name: omer, dtype: float64

In [34]:
df.iloc[1,2] #nokta atışı yerler için iloc

-0.005054717562678283

In [42]:
#alinin maaşı nedir 2.satır 1.sütun
df.iloc[2,1]
df.loc['ali']['MAAŞ']#ikiside aynı görevi görür

-0.5619117654629254

In [37]:
#YENİ KOLON EKLEME
df['extra']=10

In [41]:
df.drop('extra',axis=1,inplace=True)#kolon atma
df

            YAŞ      MAAŞ   TELEFON
omer   1.241410  0.254129 -0.262377
cihan  0.759339  1.079162 -0.005055
ali   -0.461731 -0.561912 -1.624737
asaf  -0.807754 -2.100753 -0.615496

In [44]:
df[df['YAŞ']>0]#yaş 0'dan büyük olan dataları getirdi

            YAŞ      MAAŞ   TELEFON
omer   1.241410  0.254129 -0.262377
cihan  0.759339  1.079162 -0.005055

In [45]:
df.reset_index(inplace=True)

In [49]:
#diyelimki indexleri değiştirmek istedik
new_index=['om','ci','al','as']
df['new_index']=new_index

In [50]:
df.set_index('new_index',inplace=True)

In [53]:
df.drop('index',axis=1,inplace=True)
df

                YAŞ      MAAŞ   TELEFON
new_index
om         1.241410  0.254129 -0.262377
ci         0.759339  1.079162 -0.005055
al        -0.461731 -0.561912 -1.624737
as        -0.807754 -2.100753 -0.615496

In [4]:
first_index=['5th','5th','5th','4th','4th','4th']
inner_index=['f35','mmu','j35','f16','f14','f15']
zipp_index=list(zip(first_index,inner_index))

In [5]:
sample_values=np.ones((6,2))

In [6]:
zipped_index_multi = pd.MultiIndex.from_tuples(zipp_index)
zipped_index_multi

MultiIndex([('5th', 'f35'),
            ('5th', 'mmu'),
            ('5th', 'j35'),
            ('4th', 'f16'),
            ('4th', 'f14'),
            ('4th', 'f15')],
           )

In [7]:
data=pd.DataFrame(sample_values,index=zipped_index_multi,columns=['yaş','değer'])

In [8]:
data

         yaş  değer
5th f35  1.0    1.0
    mmu  1.0    1.0
    j35  1.0    1.0
4th f16  1.0    1.0
    f14  1.0    1.0
    f15  1.0    1.0

In [9]:
data.loc['5th'].loc['f35']

yaş      1.0
değer    1.0
Name: f35, dtype: float64

PANDAS OPERATİON

In [14]:
data=pd.read_excel('6-weather.xlsx')

In [16]:
data.head(5)

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20

In [18]:
data.mean() #şehirlerin ortlaaması

Istanbul     21.444444
New York     13.111111
Amsterdam    16.777778
Paris        15.555556
dtype: float64

In [19]:
data.info() #veri seti bilgisi

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Istanbul   9 non-null      int64
 1   New York   9 non-null      int64
 2   Amsterdam  9 non-null      int64
 3   Paris      9 non-null      int64
dtypes: int64(4)
memory usage: 420.0 bytes

In [22]:
data.describe()

        Istanbul   New York  Amsterdam      Paris
count   9.000000   9.000000   9.000000   9.000000
mean   21.444444  13.111111  16.777778  15.555556
std     3.609401   2.147350   2.538591   2.351123
min    15.000000  10.000000  14.000000  12.000000
25%    20.000000  12.000000  15.000000  14.000000
50%    21.000000  13.000000  16.000000  15.000000
75%    22.000000  15.000000  18.000000  16.000000
max    28.000000  16.000000  22.000000  20.000000

In [30]:
data.isna().sum()

Istanbul     0
New York     0
Amsterdam    0
Paris        0
dtype: int64